reports/stage3/async/wrkLogsPut.txt
Running 15s test @ http://localhost:8080
  1 threads and 65 connections
  Thread calibration: mean lat.: 1.199ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.17ms  489.15us   2.99ms   63.84%
    Req/Sec     2.11k   162.53     2.78k    75.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.53ms
 90.000%    1.83ms
 99.000%    2.27ms
 99.900%    2.75ms
 99.990%    2.93ms
 99.999%    2.99ms
100.000%    2.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.135     0.000000            1         1.00
       0.520     0.100000          936         1.11
       0.712     0.200000         1873         1.25
       0.865     0.300000         2805         1.43
       1.002     0.400000         3741         1.67
       1.145     0.500000         4680         2.00
       1.211     0.550000         5145         2.22
       1.289     0.600000         5610         2.50
       1.366     0.650000         6082         2.86
       1.444     0.700000         6548         3.33
       1.529     0.750000         7014         4.00
       1.576     0.775000         7252         4.44
       1.622     0.800000         7484         5.00
       1.670     0.825000         7718         5.71
       1.721     0.850000         7948         6.67
       1.772     0.875000         8188         8.00
       1.799     0.887500         8303         8.89
       1.831     0.900000         8420        10.00
       1.869     0.912500         8534        11.43
       1.905     0.925000         8650        13.33
       1.940     0.937500         8768        16.00
       1.961     0.943750         8828        17.78
       1.993     0.950000         8885        20.00
       2.018     0.956250         8941        22.86
       2.049     0.962500         9000        26.67
       2.083     0.968750         9060        32.00
       2.105     0.971875         9088        35.56
       2.129     0.975000         9119        40.00
       2.151     0.978125         9146        45.71
       2.175     0.981250         9175        53.33
       2.207     0.984375         9204        64.00
       2.219     0.985938         9220        71.11
       2.233     0.987500         9234        80.00
       2.253     0.989062         9249        91.43
       2.277     0.990625         9263       106.67
       2.327     0.992188         9278       128.00
       2.355     0.992969         9286       142.22
       2.369     0.993750         9292       160.00
       2.395     0.994531         9299       182.86
       2.417     0.995313         9307       213.33
       2.461     0.996094         9314       256.00
       2.491     0.996484         9318       284.44
       2.511     0.996875         9321       320.00
       2.539     0.997266         9325       365.71
       2.601     0.997656         9329       426.67
       2.617     0.998047         9332       512.00
       2.637     0.998242         9334       568.89
       2.657     0.998437         9336       640.00
       2.695     0.998633         9338       731.43
       2.753     0.998828         9341       853.33
       2.753     0.999023         9341      1024.00
       2.771     0.999121         9342      1137.78
       2.773     0.999219         9343      1280.00
       2.789     0.999316         9345      1462.86
       2.789     0.999414         9345      1706.67
       2.803     0.999512         9346      2048.00
       2.803     0.999561         9346      2275.56
       2.821     0.999609         9347      2560.00
       2.821     0.999658         9347      2925.71
       2.915     0.999707         9348      3413.33
       2.915     0.999756         9348      4096.00
       2.915     0.999780         9348      4551.11
       2.929     0.999805         9349      5120.00
       2.929     0.999829         9349      5851.43
       2.929     0.999854         9349      6826.67
       2.929     0.999878         9349      8192.00
       2.929     0.999890         9349      9102.22
       2.991     0.999902         9350     10240.00
       2.991     1.000000         9350          inf
#[Mean    =        1.170, StdDeviation   =        0.489]
#[Max     =        2.990, Total count    =         9350]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  312.00us
 75.000%  490.00us
 90.000%  625.00us
 99.000%    0.93ms
 99.900%    1.29ms
 99.990%    1.83ms
 99.999%    1.87ms
100.000%    1.87ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.071     0.000000            1         1.00
       0.198     0.100000          972         1.11
       0.226     0.200000         1890         1.25
       0.249     0.300000         2818         1.43
       0.275     0.400000         3771         1.67
       0.312     0.500000         4683         2.00
       0.342     0.550000         5152         2.22
       0.379     0.600000         5611         2.50
       0.420     0.650000         6082         2.86
       0.455     0.700000         6547         3.33
       0.490     0.750000         7013         4.00
       0.507     0.775000         7255         4.44
       0.525     0.800000         7489         5.00
       0.546     0.825000         7715         5.71
       0.567     0.850000         7953         6.67
       0.592     0.875000         8189         8.00
       0.608     0.887500         8299         8.89
       0.625     0.900000         8421        10.00
       0.642     0.912500         8532        11.43
       0.663     0.925000         8653        13.33
       0.688     0.937500         8768        16.00
       0.702     0.943750         8829        17.78
       0.718     0.950000         8883        20.00
       0.738     0.956250         8943        22.86
       0.765     0.962500         9001        26.67
       0.789     0.968750         9058        32.00
       0.804     0.971875         9090        35.56
       0.817     0.975000         9119        40.00
       0.831     0.978125         9148        45.71
       0.853     0.981250         9175        53.33
       0.874     0.984375         9204        64.00
       0.888     0.985938         9219        71.11
       0.905     0.987500         9234        80.00
       0.914     0.989062         9248        91.43
       0.934     0.990625         9263       106.67
       0.949     0.992188         9277       128.00
       0.963     0.992969         9287       142.22
       0.973     0.993750         9292       160.00
       0.989     0.994531         9299       182.86
       1.008     0.995313         9307       213.33
       1.025     0.996094         9314       256.00
       1.050     0.996484         9318       284.44
       1.056     0.996875         9321       320.00
       1.085     0.997266         9325       365.71
       1.131     0.997656         9329       426.67
       1.175     0.998047         9332       512.00
       1.195     0.998242         9334       568.89
       1.219     0.998437         9336       640.00
       1.252     0.998633         9338       731.43
       1.279     0.998828         9340       853.33
       1.288     0.999023         9341      1024.00
       1.289     0.999121         9342      1137.78
       1.300     0.999219         9343      1280.00
       1.310     0.999316         9344      1462.86
       1.329     0.999414         9345      1706.67
       1.348     0.999512         9346      2048.00
       1.348     0.999561         9346      2275.56
       1.495     0.999609         9347      2560.00
       1.495     0.999658         9347      2925.71
       1.814     0.999707         9348      3413.33
       1.814     0.999756         9348      4096.00
       1.814     0.999780         9348      4551.11
       1.830     0.999805         9349      5120.00
       1.830     0.999829         9349      5851.43
       1.830     0.999854         9349      6826.67
       1.830     0.999878         9349      8192.00
       1.830     0.999890         9349      9102.22
       1.870     0.999902         9350     10240.00
       1.870     1.000000         9350          inf
#[Mean    =        0.375, StdDeviation   =        0.183]
#[Max     =        1.870, Total count    =         9350]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29711 requests in 15.00s, 1.90MB read
Requests/sec:   1980.60
Transfer/sec:    129.59KB